# Завдання 2. Пошук телефонних номерів
# Напишіть функцію, яка знаходить усі телефонні номери в тексті. Номери можуть бути в форматах:
#
# (123) 456-7890
# 123-456-7890
# 123.456.7890
# 1234567890

import re
from typing import List


def find_phone_numbers(text: str) -> List[str]:
    """
    Знаходить усі телефонні номери в тексті у форматах:
    - (123) 456-7890
    - 123-456-7890
    - 123.456.7890
    - 1234567890

    :param text: вхідний текст для пошуку.

    :return: List[str]: список знайдених телефонних номерів.
    """
    # pattern = r"\(?\d{3}\)?[\s\-.]?\d{3}[\s\-.]?\d{4}"

    pattern = r"""
        (                           # початок групи для всього номеру
            \(?\d{3}\)?             # код: (123) або 123
            [\s\-.]?                # необов'язковий роздільник: пробіл, дефіс або крапка \s-пробельный символ
            \d{3}                   # перші 3 цифри
            [\s\-.]?                # ще один необов’язковий роздільник
            \d{4}                   # останні 4 цифри
        )
    """
    return re.findall(pattern, text, re.VERBOSE)


text = """
Мій номер: (123) 456-7890.
Інший — 123-456-7890 або 123.456.7890.
Ще один варіант — 1234567890.
яостлр 456-7890
"""

numbers = find_phone_numbers(text)
print(numbers)

# re.VERBOSE (або re.X) — це режим читабельності для регулярних виразів
# Дозволяє: Розбивати шаблон на кілька рядків
# Додавати коментарі прямо в шаблон (після #)
# Ігнорувати пробіли поза символічними класами ([...])
