# Написати функцію my_sum, яка перекриває вбудовану функцію sum.
# Функція поинна просто виводити повідомлення: "This is my custom sum function!".
# Функція поинна просто виводити повідомлення: "This is my custom sum function!".

def my_sum(*args):
    return "This is my custom sum function!"


original_sum = sum  # якщо я хочу зберегти початкову ф-ю
sum = my_sum

task1 = range(1, 10)
print(sum(task1))
print(my_sum(task1))

#повертаю original_sum
sum = original_sum
print(sum(task1))
print(my_sum(task1))

# Що відбувається, коли локальна функція має те саме ім’я, що й вбудована?
# Вона перекриває вбудовану у поточній області видимості. Виклик по імені виконає локальну функцію.

# Як отримати доступ до вбудованої функції, навіть якщо вона перекрита?
# - зберегти оригнальну функцію, та потім її повернути
# - Використати builtins.<назва_функції> або __builtins__.<назва_функції>.
