import re

string: str = "1Ivanov2Petrov3SydorovFedor4BondarenkoKristyna"

# Шукає цифру, за якою йде послідовність:
# (Велика літера) + (малі літери) + (Велика літера) + (малі літери)
# Примітка: Шаблон складний і, ймовірно, містить логічні помилки для цього рядка.
result = re.findall(pattern=r'\d([A-Z])([a-z]+)([A-Z])([a-z]+)', string=string)
print(result)

# Шукає цифру, за якою йде (Велика літера) + (малі літери) + (будь-яка літера)+
# Примітка: Шаблон складний і, ймовірно, містить логічні помилки для цього рядка.
result = re.findall(pattern=r'\d[A-Z][a-z]+([A-Z][a-z]+)', string=string)
print(result)

# Шукає цифру, за якою йде (Велика літера) + (малі літери), а потім (Велика літера) + (малі літери)
# Примітка: Цей шаблон найточніше відповідає структурі (Прізвище)(Ім'я), розділеній цифрами.
result = re.findall(r'\d([A-Z][a-z]+)([A-Z][a-z]+)', string)
print(result)